case/MotionTest/constant/beam/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 -0.570732 -0.570732)
    (78.54 -0.570732 -0.570732)
    (78.54 0.570732 -0.570732)
    (0 0.570732 -0.570732)
    (0 -0.570732 0.570732)
    (78.54 -0.570732 0.570732)
    (78.54 0.570732 0.570732)
    (0 0.570732 0.570732)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (25 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    left
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    right
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
    topAndBottom
    {
        type empty;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
