case/MotionTest/constant/beam/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    left
    {
        type            wall;
        nFaces          1;
        startFace       24;
    }
    right
    {
        type            wall;
        nFaces          1;
        startFace       25;
    }
    frontAndBack
    {
        type            empty;
        nFaces          50;
        startFace       26;
    }
    topAndBottom
    {
        type            empty;
        nFaces          50;
        startFace       76;
    }
)


// ************************************************************************* //
