case/MotionTest/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    topAndBottom
    {
        type            patch;
        nFaces          150;
        startFace       71816;
    }
    inlet
    {
        type            patch;
        nFaces          48;
        startFace       71966;
    }
    outlet
    {
        type            patch;
        nFaces          48;
        startFace       72014;
    }
    wing
    {
        type            wall;
        nFaces          778;
        startFace       72062;
    }
    symBack
    {
        type            empty;
        nFaces          35801;
        startFace       72840;
    }
    symFront
    {
        type            empty;
        nFaces          35801;
        startFace       108641;
    }
)


// ************************************************************************* //
