case/MotionTest/0.org/include/frontBackTopBottomPatches
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

topAndBottom
{
    type slip;
}

front
{
    type empty
}

back
{
    type empty;
}

// ************************************************************************* //
